# Pandas Functions

In [2]:
import pandas as pd

csv_1 = pd.read_csv("dict1.csv")

csv_1

     name  marks      city
0  maulik     90       una
1   patel     70  khilavad

In [4]:
csv_1.index

RangeIndex(start=0, stop=2, step=1)

In [6]:
csv_1.columns

Index(['name', 'marks', 'city'], dtype='object')

In [8]:
 csv_1.describe()

           marks
count   2.000000
mean   80.000000
std    14.142136
min    70.000000
25%    75.000000
50%    80.000000
75%    85.000000
max    90.000000

In [9]:
csv_1.head()

     name  marks      city
0  maulik     90       una
1   patel     70  khilavad

In [10]:
csv_1.head(1)

     name  marks city
0  maulik     90  una

In [11]:
csv_1.tail()

     name  marks      city
0  maulik     90       una
1   patel     70  khilavad

In [12]:
csv_1.tail(1)

    name  marks      city
1  patel     70  khilavad

In [14]:
csv_1[:1]

     name  marks city
0  maulik     90  una

In [15]:
csv_1[1:2]

    name  marks      city
1  patel     70  khilavad

In [16]:
csv_1.index.array

<PandasArray>
[0, 1]
Length: 2, dtype: int64

In [17]:
csv_1.to_numpy()

array([['maulik', 90, 'una'],
       ['patel', 70, 'khilavad']], dtype=object)

In [18]:
import numpy as np
v = np.asarray(csv_1)
v

array([['maulik', 90, 'una'],
       ['patel', 70, 'khilavad']], dtype=object)

In [19]:
csv_1.sort_index(axis=0, ascending=False)

     name  marks      city
1   patel     70  khilavad
0  maulik     90       una

In [24]:
csv_1["name"][0]="python"
csv_1

/tmp/ipykernel_31136/520405573.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  csv_1["name"][0]="python"

     name  marks      city
0  python     90       una
1   patel     70  khilavad

In [25]:
csv_1.loc[0,"name"]="maulik"
csv_1

     name  marks      city
0  maulik     90       una
1   patel     70  khilavad

In [27]:
csv_1.loc[[0,1],["name","marks"]]

     name  marks
0  maulik     90
1   patel     70

In [28]:
csv_1.loc[:,["name","marks"]]

     name  marks
0  maulik     90
1   patel     70

In [30]:
csv_1.iloc[0,2]

'una'

In [33]:
csv_1.drop("marks", axis=1)

     name      city
0  maulik       una
1   patel  khilavad

In [34]:
csv_1.drop(0, axis=0)

    name  marks      city
1  patel     70  khilavad